Cnkrru/Hareware/STM32/Serial.c
//=======================================
//函数 ：串口初始化
//串口：USART1
//引脚：PA9(TX)、PA10(RX)
//波特率：9600
//功能如下：
//1.发送一个字节       例如"A"
//2.发送一个数组       例如"1234567890"
//3.发送一个字符串     例如"Hello World!"
//4.发送一个数字       例如"1234567890"
//5.prinf函数
//=======================================
#include "stm32f10x.h"                  // Device header
#include <stdio.h>
#include <stdarg.h>
#include "misc.h"

//全局变量
uint8_t Serial_RxFlag;
uint8_t Serial_RxData = 0;
uint8_t Serial_Tx_Data_Group[4];				//定义发送数据数组，数据包格式：FF 01 02 03 04 FE
uint8_t Serial_Rx_Data_Group[4];				//定义接收数据数组

void Serial_Init(void)
{
	//开启时钟
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);	//开启USART1的时钟
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);	//开启GPIOA的时钟
	
	//GPIO初始化
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);					//将PA9引脚初始化为复用推挽输出
	
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);					//将PA10引脚初始化为上拉输入
	
	//USART初始化
	USART_InitTypeDef USART_InitStructure;					//定义结构体变量
	USART_InitStructure.USART_BaudRate = 9600;				//波特率
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;	//硬件流控制，不需要
	USART_InitStructure.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;	//模式，发送模式和接收模式均选择
	USART_InitStructure.USART_Parity = USART_Parity_No;		//奇偶校验，不需要
	USART_InitStructure.USART_StopBits = USART_StopBits_1;	//停止位，选择1位
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;		//字长，选择8位
	USART_Init(USART1, &USART_InitStructure);				//将结构体变量交给USART_Init，配置USART1
	
	//中断输出配置
	USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);			//开启串口接收数据的中断
	
	//NVIC中断分组
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);			//配置NVIC为分组2
	
	//NVIC配置
	NVIC_InitTypeDef NVIC_InitStructure;					//定义结构体变量
	NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;		//选择配置NVIC的USART1线
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;			//指定NVIC线路使能
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;		//指定NVIC线路的抢占优先级为1
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;		//指定NVIC线路的响应优先级为1
	NVIC_Init(&NVIC_InitStructure);							//将结构体变量交给NVIC_Init，配置NVIC外设
	
	//USART使能
	USART_Cmd(USART1, ENABLE);								//使能USART1，串口开始运行
}

//=======================================
//函数 ：串口发送一个字节
//参数 ：Byte 要发送的一个字节
//=======================================
void Serial_SendByte(uint8_t Byte)
{
	USART_SendData(USART1, Byte);		//将字节数据写入数据寄存器，写入后USART自动生成时序波形
	while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET);	//等待发送完成
	//下次写入数据寄存器会自动清除发送完成标志位，故此循环后，无需清除标志位
}

//=======================================
//函数 ：串口发送一个数组
//参数 ：Array 要发送数组的首地址
//参数 ：Length 要发送数组的长度
//=======================================
void Serial_SendArray(uint8_t *Array, uint16_t Length)
{
	uint16_t i;
	for (i = 0; i < Length; i ++)		//遍历数组
	{
		Serial_SendByte(Array[i]);		//依次调用Serial_SendByte发送每个字节数据
	}
}

//=======================================
//函数 ：串口发送一个字符串
//参数 ：String 要发送字符串的首地址
//=======================================
void Serial_SendString(char *String)
{
	uint8_t i;
	for (i = 0; String[i] != '\0'; i ++)//遍历字符数组（字符串），遇到字符串结束标志位后停止
	{
		Serial_SendByte(String[i]);		//依次调用Serial_SendByte发送每个字节数据
	}
}

//=======================================
//函数 ：X的Y次方函数（内部使用）
//=======================================
uint32_t Serial_Pow(uint32_t X, uint32_t Y)
{
	uint32_t Result = 1; 	//设置结果初值为1
	while (Y --)			//执行Y次
	{
		Result *= X;		//将X累乘到结果
	}
	return Result;
}

//=======================================
//函数 ：串口发送数字
//参数 ：Number 要发送的数字，范围：0~4294967295
//参数 ：Length 要发送数字的长度，范围：0~10
//=======================================
void Serial_SendNumber(uint32_t Number, uint8_t Length)
{
	uint8_t i;
	for (i = 0; i < Length; i ++)		//根据数字长度遍历数字的每一位
	{
		Serial_SendByte(Number / Serial_Pow(10, Length - i - 1) % 10 + '0');	//依次调用Serial_SendByte发送每位数字
	}
}

//=======================================
//函数 ：使用printf需要重定向的底层函数
//参数 ：ch 要发送的字符
//参数 ：f 文件指针
//返回值：返回发送的字符
//=======================================
int fputc(int ch, FILE *f)
{
	Serial_SendByte(ch);			//将printf的底层重定向到自己的发送字节函数
	return ch;
}

//=======================================
//函数 ：自己封装的prinf函数
//参数 ：format 格式化字符串
//参数 ：... 可变的参数列表
//=======================================
void Serial_Printf(char *format, ...)
{
	char String[100];				//定义字符数组
	va_list arg;					//定义可变参数列表数据类型的变量arg
	va_start(arg, format);				//从format开始，接收参数列表到arg变量
	vsprintf(String, format, arg);		//使用vsprintf打印格式化字符串和参数列表到字符数组中
	va_end(arg);					//结束变量arg
	Serial_SendString(String);			//串口发送字符数组（字符串）
}

//=======================================
//函数 ：获取串口接收标志位
//返回值：串口接收标志位，范围：0~1，接收到数据后，标志位置1，读取后标志位自动清零
//=======================================
uint8_t Serial_GetRxFlag(void)
{
	if (Serial_RxFlag == 1) 		//如果标志位为1
	{
		Serial_RxFlag = 0;
		return 1; 				//则返回1，并自动清零标志位
	}
	return 0; 					//如果标志位为0，则返回0
}

//=======================================
//函数 ：获取串口接收的数据
//返回值：接收的数据，范围：0~255
//=======================================
uint8_t Serial_GetRxData(void)
{
	return Serial_RxData; 			//返回接收的数据变量
}

//=======================================
//函数 ：串口发送数据包
//说明：调用此函数后，Serial_TxPacket数组的内容将加上包头（FF/其他自定义）包尾（FE）后，作为数据包发送出去
//=======================================
void Serial_SendPacket(void)
{
	Serial_SendByte(0xFF);
	Serial_SendArray(Serial_Tx_Data_Group, 4);
	Serial_SendByte(0xFE);
}

//=======================================
//函数 ：USART1中断函数框架
//=======================================
// void USART1_IRQHandler(void)
// {
// 	if (USART_GetITStatus(USART1, USART_IT_RXNE) == SET) 		//判断是否是USART1的接收事件触发的中断
// 	{

// 		USART_ClearITPendingBit(USART1, USART_IT_RXNE); 			//清除USART1的RXNE标志位
// 	}
// }

//=======================================
//函数 ：USART1中断函数
//=======================================
void USART1_IRQHandler(void)
{
	static uint8_t State = 0;		//定义表示当前状态机状态的静态变量
	static uint8_t Data_Group_Index = 0; 		//定义表示当前接收数据位置的静态变量

	if (USART_GetITStatus(USART1, USART_IT_RXNE) == SET)
	{
		Serial_RxData = USART_ReceiveData(USART1);
	
	if (State == 0)
	{
		if (Serial_RxData == 0xFF && Serial_RxFlag == 0) 		//如果数据确实是包头，并且上一个数据包已处理完毕
		{
			State = 1; 			//置下一个状态
			Data_Group_Index = 0; 			//数据包的位置归零
		}
	}

	else if (State == 1)
	{
		Serial_Rx_Data_Group[Data_Group_Index] = Serial_RxData;	//将数据存入数据包数组的指定位置
		Data_Group_Index ++; 				//数据包的位置自增
		if (Data_Group_Index >= 4) 			//如果收够4个数据   
		{
			State = 2; 			//置下一个状态
		}
	}

	else if (State == 2)
	{
		if (Serial_RxData == 0xFE) 		//如果数据确实是包尾部
		{
			State = 0; 			//状态归0
			Serial_RxFlag = 1; 		//接收数据包标志位置1，成功接收一个数据包
		}
	}
		USART_ClearITPendingBit(USART1, USART_IT_RXNE);
	}
}